cyinsetin/test/nRF51_SDK_10.0.0/examples/peripheral/uart_20161117/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 * @defgroup uart_example_main main.c
 * @{
 * @ingroup uart_example
 * @brief UART Example Application main file.
 *
 * This file contains the source code for a sample application using UART.
 * 
 */

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include "boards.h"
#include "app_uart.h"
#include "app_error.h"
#include "nrf_delay.h"
#include "nrf.h"
#include "bsp.h"
#include "LIS3DH_Driver.h"
#include "SEGGER_RTT.H"
#include "SEGGER_RTT_Conf.h"

//#define ENABLE_LOOPBACK_TEST  /**< if defined, then this example will be a loopback test, which means that TX should be connected to RX to get data loopback. */

#define MAX_TEST_DATA_BYTES     (15U)                /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 1                           /**< UART RX buffer size. */

void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}



#ifdef ENABLE_LOOPBACK_TEST
/** @brief Function for setting the @ref ERROR_PIN high, and then enter an infinite loop.
 */
static void show_error(void)
{
    
    LEDS_ON(LEDS_MASK);
    while(true)
    {
        // Do nothing.
    }
}


/** @brief Function for testing UART loop back. 
 *  @details Transmitts one character at a time to check if the data received from the loopback is same as the transmitted data.
 *  @note  @ref TX_PIN_NUMBER must be connected to @ref RX_PIN_NUMBER)
 */
static void uart_loopback_test()
{
    uint8_t * tx_data = (uint8_t *)("\n\rLOOPBACK_TEST\n\r");
    uint8_t   rx_data;

    // Start sending one byte and see if you get the same
    for (uint32_t i = 0; i < MAX_TEST_DATA_BYTES; i++)
    {
        uint32_t err_code;
        while(app_uart_put(tx_data[i]) != NRF_SUCCESS);

        nrf_delay_ms(10);
        err_code = app_uart_get(&rx_data);

        if ((rx_data != tx_data[i]) || (err_code != NRF_SUCCESS))
        {
            show_error();
        }
    }
    return;
}


#endif


/**
 * @brief Function for main application entry.
 */

static uint8_t	Test_Byte;
uint16_t X,Y,Z;

int main(void)
{
    LEDS_CONFIGURE(LEDS_MASK);
    LEDS_OFF(LEDS_MASK);
    uint32_t err_code;
		//uint16_t x,y,z;
		BYTE	Temp[6]={0};
		
    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud38400
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);

    APP_ERROR_CHECK(err_code);

#ifndef ENABLE_LOOPBACK_TEST
    printf("\n\rStart: \n\r");
			
		nrf_delay_ms(1000);
		nrf_gpio_pin_clear(BSP_LED_2);
		nrf_delay_ms(1000);
		nrf_gpio_pin_set(BSP_LED_2);
		
		//Enable_GSensor();
		
    while (true)
    {
        uint8_t cr;
				
				nrf_delay_ms(100);
				nrf_gpio_pin_clear(BSP_LED_0);
				nrf_delay_ms(100);
				nrf_gpio_pin_set(BSP_LED_0);
				
				Read_Sen_datas(0x0f,&Test_Byte,1);
				
				SEGGER_RTT_printf(0,"G_Sensor ID=:%x\r\n",Test_Byte);
				nrf_delay_ms(100);
				
				//Enable_GSensor();
				Enable_GSensor2();
				nrf_delay_ms(100);
				Read_Sen_datas(0x28,Temp,6);
				
				X=(Temp[0]>>4)|(WORD)Temp[1]<<4;
				Y=(Temp[2]>>4)|(WORD)Temp[3]<<4;
				Z=(Temp[4]>>4)|(WORD)Temp[5]<<4;
				
				SEGGER_RTT_printf(0,"X-Axis = :%x\r\n",X);
				SEGGER_RTT_printf(0,"Y-Axis = :%x\r\n",Y);
				SEGGER_RTT_printf(0,"Z-Axis = :%x\r\n",Z);
				
				nrf_delay_ms(50);
				Disable_GSensor();
				
        //while(app_uart_get(&cr) != NRF_SUCCESS);
        //while(app_uart_put(cr) != NRF_SUCCESS);
					
				
        /*
				if (cr == 'q' || cr == 'Q')
        {
            printf(" \n\rExit!\n\r");

            while (true)
            {
                // Do nothing.
							nrf_delay_ms(100);
							nrf_gpio_pin_clear(BSP_LED_0);
							nrf_delay_ms(100);
							nrf_gpio_pin_set(BSP_LED_0);
            }
        }
				*/
    }
#else

    // This part of the example is just for testing the loopback .
    while (true)
    {
        //uart_loopback_test();
				nrf_delay_ms(1000);
				nrf_gpio_pin_clear(BSP_LED_1);
				nrf_delay_ms(1000);
				nrf_gpio_pin_set(BSP_LED_1);
    }
#endif
}


/** @} */
